import React from "react";

import Layout from "../components/layout";
import Seo from "../components/seo";

const OfertaPage = () => {
  return (
    <Layout>
      <Seo
        title="Публічна оферта - Mike Koval"
        description="Публічний договір про надання послуг (оферта) - koval.dev"
        noindex={true}
      />
      <main className="oferta max-w-5xl mx-auto my-10 py-10 prose">
        <h1>Публічний договір про надання послуг (оферта)</h1>

        <div>Дата: 18 грудня 2021 року</div>

        <p>
          ФОП Коваль Михайло Юрійович, що діє на підставі виписки з Єдиного
          державного реєстру юридичних осіб та фізичних осіб-підприємців{" "}
          <span className="whitespace-nowrap">№2 072 000 0000 040295</span> від
          15.08.2017 та перебуває на спрощеній системі оподаткування (далі –
          «Виконавець») з однієї сторони,
          <br />
          та
          <br />
          особа, що приєдналась до даного Договору шляхом оплати ціни послуг
          Виконавця (далі – «Замовник»), з іншої сторони, які надалі при
          спільному згадуванні іменуються як Сторони, а кожен окремо – як
          Сторона, уклали цей Публічний договір про надання послуг (оферта) про
          наступне:
        </p>

        <h2>1. ЗАГАЛЬНІ ПОЛОЖЕННЯ</h2>

        <p>
          1.1. Викладений нижче текст Договору про надання послуг (оферта)
          адресований фізичним та/або юридичним особам є офіційною публічною
          пропозицією Виконавця, укласти з Замовником Договір про надання послуг
          (оферта) (далі – «Договір»).
        </p>

        <p>
          1.2. Цей Договір є договором приєднання відповідно до статті 634
          Цивільного кодексу України. Замовник приєднується до цього Договору в
          цілому шляхом повної або часткової оплати ціни послуг Виконавця, що
          свідчить про повне та безумовне прийняття (акцепт) Замовником усіх
          умов цього Договору. Замовнику надається можливість приєднатися до
          цього Договору при замовленні послуг Виконавця. Ознайомитись з умовами
          Договору Замовник може на веб-сайті Виконавця
          https://koval.dev/oferta/. Виконавець перед прийняттям Замовником
          рішення про приєднання до цього Договору надає Замовнику усю необхідну
          інформацію про Послуги та відповідає на всі питання Замовника стосовно
          Послуг.
        </p>

        <p>
          1.3. Пропозиція про зміну Договору, а також його розірвання
          здійснюється на підставі письмової заяви Замовника, поданої у
          письмовому чи у електронному вигляді, шляхом направлення на поштову
          адресу Виконавця та/або електронну адресу: m@koval.email.
        </p>

        <h2>2. ПРЕДМЕТ ДОГОВОРУ</h2>
        <p>
          2.1. Виконавець зобов’язується виконувати, а Замовник — приймати й
          оплачувати послуги у сфері інформаційних технологій, в тому числі, але
          не виключно, послуги з управління рекламною кампанією в Системах
          залучення трафіку, SEO, розробка та технічна підтримка вебсайту,
          надання консультацій тощо (далі — «Послуги»).
        </p>

        <p>
          2.2. Виконавець має право залучати до надання Послуг за цим Договором
          третіх осіб, укладаючи з ними від свого імені угоди та здійснюючи
          розрахунки. Якщо Виконавець залучив третіх осіб для виконання своїх
          зобов'язань за цим Договором, відповідальність за дії третіх осіб несе
          Виконавець, вартість послуг Виконавця залишається незмінною і не тягне
          для Замовника яких-небудь додаткових витрат.
        </p>
        <h2>3. ОБОВ’ЯЗКИ ВИКОНАВЦЯ</h2>

        <p>
          3.1. Повідомляти Замовника про зміну тарифних планів, шляхом
          надсилання електронного листа Замовнику, не пізніше ніж за 7 (сім)
          календарних днів до їх зміни.
        </p>

        <p>3.2. Виконати Послуги в повному обсязі та в узгоджені терміни.</p>

        <h2>4. ОБОВ’ЯЗКИ ЗАМОВНИКА</h2>

        <p>
          4.1. Здійснювати оплату Послуг Виконавця у порядку, розмірі та в
          строки, визначені рахунком-фактурою або Договором, або додатковими
          угодами, а також належним чином оплачувати послуги Систем залучення
          трафіку, з використанням яких здійснюється надання Послуг Виконавцем.
        </p>

        <p>
          4.2. Приймати належним чином надані Послуги, підписувати та направляти
          наданий Виконавцем Акт про надання послуг у строки та порядку,
          передбачені Договором (далі - «Акт»).
        </p>

        <p>
          4.3. Забезпечити протягом строку дії Договору вільний доступ Виконавця
          до інформації, розташованої за URL-адресами сайту Замовника, його
          облікових записів (аккаунтів) у Системі залучення трафіку, Системі
          (сервісі) вебаналітики, виключно з метою виконання зобов’язань за
          Договором.
        </p>

        <p>
          4.4. На вимогу Виконавця Замовник зобов’язаний надати протягом 2
          (двох) робочих днів методичні розробки, облікові схеми, вихідні дані,
          документи, алгоритми розрахунків та іншу інформацію, необхідну
          Виконавцю для виконання цього Договору. У разі ненадання інформації в
          зазначений термін, Виконавець має право в односторонньому порядку
          змінити терміни надання Послуг, які були раніше погоджені Сторонами.
        </p>

        <p>
          4.5. Не пізніше ніж за 5 (п'ять) календарних днів до початку надання
          Послуг за кожним звітним періодом узгодити з Виконавцем налаштування
          рекламних кампаній.
        </p>

        <p>
          4.6. Належним чином впроваджувати та виконувати рекомендації
          Виконавця, що надаються Виконавцем.
        </p>

        <p>
          4.7. При виникненні необхідності зміни налаштувань та/або доступів до
          Облікових записів (аккаунтів) Замовника у Системі залучення трафіку,
          Системі (сервісі) вебаналітики, а також зміни налаштувань, структури
          чи змісту (у тому числі Реклами в цілому чи змісту окремих рекламних
          оголошень) Рекламної кампанії Замовника, щодо якої надаються Послуги,
          попередньо погодити всі зміни з Виконавцем.
        </p>

        <p>
          4.8. Якщо інше не передбачено Договором, розв'язувати будь-які питання
          щодо ходу надання Послуг шляхом електронного листування Сторін,
          зокрема через адреси електронної пошти, що вказані в реквізитах цього
          Договору або за допомогою месенджерів.
        </p>

        <h2>5. ВАРТІСТЬ ПОСЛУГ ТА ПОРЯДОК ЇХ ОПЛАТИ</h2>

        <p>
          5.1. Абонентські Послуги, які мають <b>фіксований обсяг</b>, що
          надаються, безперервно на регулярній основі, сплачуються Замовником
          щомісяця, на умовах попередньої (авансової) оплати на підставі рахунку
          Виконавця. Не пізніше останнього числа кожного місяця Виконавець
          виставляє Замовнику рахунок-фактуру на сплату абонентських Послуг за
          наступний місяць. Сторони домовились, що рахунки-фактури пересилається
          електронною поштою або месенджерами.
        </p>

        <p>
          5.2. Протягом 5 (п’яти) банківських днів Замовник сплачує отриманий
          рахунок або направляє мотивовану відмову. Якщо протягом цього строку
          рахунок не опротестовано він вважається прийнятим до оплати.
        </p>

        <p>
          5.3. Разові Послуги, що надаються <b>під замовлення</b>, здійснюються
          на умовах попередньої оплати або часткової розстрочки платежу. В
          такому випадку порядок оплати визначається додатково у
          рахунку-фактурі.
        </p>

        <p>
          5.4. Розрахунки між Замовником та Виконавцем проводяться у
          національній валюті України в еквіваленті вартості Послуг у доларах
          США. Сума до сплати розраховується Виконавцем за офіційним курсом
          продажу в доларах США на міжбанківському валютному ринку України,
          розміщеним на сайті https://finance.liga.net/currency/mb на день
          виставлення рахунку.
        </p>

        <p>
          5.5. Виконавець має право в односторонньому порядку підвищувати
          вартість Послуг. Виконавець повідомляє про це Замовника не менше ніж
          за 10 (десять) календарних днів. Після закінчення вказаного вище
          терміну Виконавець має право зупинити надання Послуг до отримання
          письмової згоди Замовника щодо зміни вартості Послуг. Замовник має
          право не погодитись з підвищенням вартості, та розірвати Договір, про
          що він має повідомити Виконавця протягом 5 (п’яти) календарних днів з
          моменту отримання повідомлення.
        </p>

        <p>
          5.6. Договір може бути розірваний не раніше ніж через один місяць з
          моменту отримання повідомлення Виконавцем.
        </p>

        <p>
          5.7. У випадку порушення Замовником встановлених строків оплати
          послуг, Виконавець має право затримати виконання Послуг на строк до їх
          повної оплати. В такому разі Виконавець звільняється від
          відповідальності за порушення строків виконання послуг.
        </p>

        <p>
          5.8. Рахунок за поповнення Аккаунту Замовника виставляються Виконавцем
          окремо або Замовник має право самостійно здійснювати поповнення
          Аккаунту. У разі отримання Виконавцем грошових коштів від Замовника
          для поповнення Аккаунту останнього, відповідна оплата має бути
          здійснена Виконавцем не пізніше наступного банківського дня з моменту
          отримання відповідної суми грошових коштів від Замовника. Грошові
          кошти за послуги Систем залучення трафіку не включаються до загальної
          вартості Послуг, але є складовою частиною ціни Договору. Вартість
          додаткових послуг погоджується Сторонами додатково.
        </p>

        <p>
          5.9. Витрати банку Виконавця, у тому числі банківські комісії
          будь-якого виду, пов’язані з цим Договором, оплачує Виконавець, а
          витрати банку Замовника - оплачує Замовник. Моментом оплати Послуг
          вважається надходження грошей на рахунок Виконавця.
        </p>

        <p>
          5.10. Сторони погодили, що Виконавець приступає до надання Послуг
          протягом 5 робочих днів з дня зарахування на банківський рахунок
          Виконавця грошових коштів від Замовника (вартості Послуг за один
          місяць надання Послуг відповідно до Договору або лише винагороди,
          залежно від способу, що визначається в рахунках).
        </p>

        <h2>6. ПОРЯДОК ЗДАЧІ-ПРИЙМАННЯ ПОСЛУГ</h2>

        <p>
          6.1. По завершенню календарного місяця, в якому надавалися Послуги,
          Сторони підписують Акт у наступному порядку та строки:
        </p>
        <ul>
          <li>
            6.1.1. Прийняття-передання наданих Послуг оформлюється шляхом
            підписання Сторонами Акту наданих за відповідний місяць Послуг. До
            Акту додається звіт про надані Послуги в електронній формі за
            відповідний місяць.
          </li>

          <li>
            6.1.2. По завершенню звітного місяця в якому надавалися Послуги,
            Виконавець оформлює та надсилає Замовнику Акт на електронну адресу
            або месенджер протягом 5 (п’яти) робочих днів місяця, що слідує за
            звітним.
          </li>

          <li>
            6.1.3. Протягом 5 (п’яти) робочих днів з дати отримання Акту
            Замовником, Замовник повинен підписати його, та направити на поштову
            адресу Виконавця один примірник підписаного Акту, або мотивовану
            відмову від його підписання.
          </li>

          <li>
            6.1.4. Якщо протягом 5 (п’яти) робочих днів з дня направлення Акту,
            Виконавець не отримає підписаний примірник Акту або мотивовану
            відмову від підписання Акту, то Акт вважається таким, що підписаний
            Сторонами, Послуги такими, що надані належним чином/належної
            якості/належної кількості/в належний термін, а Замовник таким, що
            прийняв Послуги.
          </li>

          <li>
            6.1.5. У разі надходження вмотивованої відповіді-відмови зі сторони
            Замовника впродовж строку, що вказаний у п. 6.1.3 Договору,
            Виконавець протягом 10 робочих днів з дати отримання вищевказаної
            відмови розглядає її та вчиняє наступі дії:
          </li>
          <ul>
            <li>
              6.1.5.1. У разі встановлення, що викладені в листі-відмови
              Замовника факти не залежать від дій Виконавця та у разі, якщо
              Виконавець при наданні Послуг, що є предметом даного Договору,
              діяв в межах повноважень та відповідно до вимог Договору, останній
              надсилає у строки, визначені п. 6.1.5. Договору вмотивований лист
              з відповідними роз’ясненнями на адресу Замовника.
            </li>

            <li>
              6.1.5.2. У разі встановлення, що викладені в листі-відмови
              Замовника факти залежать від дій та/або бездіяльності Виконавця,
              складається двосторонній акт в якому перераховуються необхідні
              доопрацювання. Виконавець зобов’язаний власним коштом виправити
              недоліки у визначені Сторонами терміни.
            </li>
          </ul>
        </ul>

        <p>
          6.2. У разі необґрунтованого й невмотивованого ухилення Замовника від
          прийняття наданих за цим Договором Послуг, якщо таке ухилення
          спричинило прострочення Виконавцем здачі наданих за Договором Послуг,
          ризик випадкового знищення або випадкового пошкодження результатів
          наданих Виконавцем Послуг переходить до Замовника з моменту, коли
          здача/приймання наданих Послуг за умовами цього Договору мала
          відбутися.
        </p>

        <h2>7. ТЕРМІН ДІЇ ДОГОВОРУ</h2>

        <p>
          7.1. Цей Договір набирає чинності в строк, що визначений п. 1.2 цього
          Договору.
        </p>
        <h2>8. ВІДПОВІДАЛЬНІСТЬ СТОРІН</h2>

        <p>
          8.1. Виконавець несе відповідальність за якість наданих Послуг у
          розмірі не більше ніж загальна сума оплати, яка отримана від Замовника
          за надану Послугу.
        </p>

        <p>
          8.2. Виконавець не несе відповідальності за збій у роботі
          інформаційної системи в частині, що піддавалася модифікації
          Замовником, або третіми особами за завданням Замовника. У такому
          випадку всі роботи з діагностики та відновлення працездатності
          інформаційної системи виконуються коштом Замовника. Усі роботи з
          відновлення працездатності інформаційної системи, виконаних Виконавцем
          і пізніше модифікованих Замовником, або третіми особами за завданням
          Замовника, вважаються додатковими роботами.
        </p>

        <p>
          8.3. Виконавець не несе відповідальність перед Замовником за збитки,
          що були ним понесені під час надання Послуг за цим Договором, у разі
          вини Замовника, який не дотримався вимог цього Договору.
        </p>

        <p>
          8.4. Виконавець не відповідає за порушення або неправомірні дії,
          допущені Замовником під час використання Послуг, що надаються
          Виконавцем.
        </p>

        <p>
          8.5. Виконавець не несе відповідальності в разі неправомірного доступу
          до інформаційних систем особою або особами, які не є Сторонами за цим
          Договором, якщо таке діяння спричинило знищення інформації, блокування
          інформації, модифікацію інформації, копіювання закритої інформації,
          порушення роботи інформаційних систем або зміна змісту деяких і/або
          всіх його сторінок або баз даних, якщо це сталося не з вини Виконавця.
        </p>

        <p>
          8.6. Виконавець не несе відповідальності за порушення строків
          виконання робіт у разі, якщо таке невиконання зумовлено несвоєчасним
          виконанням зобов’язань Замовника.
        </p>

        <p>
          8.7. У випадку прострочення здійснення оплати Замовником Послуг по
          даному Договору, окрім авансових платежів та попередньої оплати,
          останній зобов’язується сплатити Виконавцю пеню у розмірі подвійної
          облікової ставки НБУ, що діяла в період, за який стягується пеня, за
          кожен день прострочення протягом усього періоду прострочення.
        </p>

        <p>
          8.8. Виконавець звільняється від відповідальності за неналежне
          виконання даного Договору, якщо воно сталось за вини Замовника чи в
          результаті несвоєчасного або неповного перерахування коштів від
          Замовника до Виконавця.
        </p>

        <h2>9. ІНТЕЛЕКТУАЛЬНА ВЛАСНІСТЬ</h2>

        <p>
          9.1. Замовник гарантує, що інформаційні матеріали, які надаються
          відповідно до умов цього Договору, не обтяжені вимогами третіх осіб,
          що Замовник є власником виняткових прав на інформаційні матеріали
          та/або володіє всіма необхідними дозволами від авторів та інших
          правовласників щодо об’єктів інтелектуальної власності, та об’єктів,
          які входять до складу творів, а також щодо первинних творів (у разі,
          якщо твір є перероблення та/або переклад), причому такі дозволи ніяким
          чином не повинні обмежувати прав Виконавця або ускладнювати
          використання твору Виконавцем відповідно до цього Договору.
        </p>

        <p>
          9.2. Виконавець не несе відповідальності за наявність ліцензій на
          програмне забезпечення, встановлене на серверах та персональних
          комп’ютерах Замовника, що обслуговується Виконавцем. Замовник повинен
          володіти необхідними ліцензіями, відповідно до вимог чинного
          законодавства України.
        </p>

        <p>
          9.3. Замовник, у разі порушення ним авторських і/або суміжних прав
          Виконавця, відповідає за кожен факт порушення в повному обсязі, у
          порядку, передбаченому чинним законодавством України.
        </p>

        <p>
          9.4. Виконавець не несе відповідальності за зміст і якість поширюваної
          Замовником в мережі Інтернет інформації.
        </p>

        <p>
          9.5. У разі пред’явлення Виконавцю претензій чи позовів із приводу
          порушення ним авторських і/або суміжних прав третіх осіб у зв’язку з
          використанням Інформаційних матеріалів, наданих Замовником, на
          виконання умов цього Договору, Замовник зобов’язується врегулювати
          такі претензії або вжити інші необхідні дії, що виключають виникнення
          витрат і збитків у Виконавця. А в разі виникнення витрат і збитків у
          Виконавця, відшкодувати їх у повному обсязі.
        </p>

        <p>
          9.6. Замовнику забороняється видаляти, змінювати або приховувати
          будь-які повідомлення про авторські права, товарні знаки або інші
          повідомлення про майнові права, що містяться в програмному
          забезпеченні, яке використовується для надання послуг Виконавцем.
        </p>

        <p>
          9.7. Виконавець жодним чином не відповідає за зміст інформації, що
          передається Замовником мережею Інтернет та що розміщується Виконавцем
          в рамках виконання цього Договору.
        </p>
        <h2>10. ОБСТАВИНИ НЕПЕРЕБОРНОЇ СИЛИ</h2>

        <p>
          10.1. Сторони звільняються від відповідальності за часткове або повне
          невиконання своїх зобов’язань за цим Договором, якщо їх виконання
          перешкоджає надзвичайна й непереборне за даних умов подія (непереборна
          сила).
        </p>

        <p>
          10.2. Під обставинами непереборної сили Сторони розуміють такі
          обставини як: землетруси, пожежі, повені, інші стихійні лиха,
          епідемії, аварії, вибухи, воєнні дії, антитерористичні операції, а
          також зміни законодавства, які потягли за собою неможливість виконання
          Сторонами своїх зобов’язань за Договором.
        </p>

        <p>
          10.3. У разі виникнення обставин непереборної сили, що перешкоджають
          виконанню зобов’язань за цим Договором однією зі Сторін, вона
          зобов’язана сповістити іншу Сторону негайно після виникнення таких
          обставин і представити іншій стороні документи, що підтверджують факт
          настання і тривалість зазначених обставин, водночас термін виконання
          зобов’язань за цим Договором переноситься пропорційно часу, протягом
          якого діяли такі обставини.
        </p>

        <p>
          10.4. Якщо обставини непереборної сили діють протягом 3 (трьох)
          послідовних місяців і не виявляють ознак припинення, цей Договір може
          бути розірваний Замовником і Виконавцем шляхом направлення
          повідомлення іншій Стороні.
        </p>
        <h2>11. КОНФІДЕНЦІЙНІСТЬ</h2>

        <p>
          11.1. Кожна зі Сторін погодилася вважати текст цього Договору, а також
          всю інформацію, передану Сторонами одна одній під час укладення цього
          Договору та у процесі виконання зобов’язань, що виникають із цього
          Договору, конфіденційною інформацією (а в межах, що допускаються
          чинним законодавством — комерційною таємницею) іншої Сторони.
        </p>

        <p>
          11.2. Кожна зі Сторін бере на себе зобов’язання ніякими способами не
          розголошувати (робити доступною будь-яким третім особам, крім випадків
          наявності в третіх осіб відповідних повноважень з огляду на прямі
          вказівки закону, або випадків, коли інша Сторона в письмовій формі
          дасть згоду на надання конфіденційної інформації третім особам)
          конфіденційну інформацію іншої Сторони, до якої вона отримала доступ
          під час укладення цього Договору та у процесі виконання зобов’язань,
          що виникають із цього Договору.
        </p>

        <h2>12. ВИРІШЕННЯ СПОРІВ</h2>

        <p>
          12.1. Всі розбіжності та спори, пов’язані з виконанням цього Договору,
          вирішуються Сторонами шляхом переговорів. У разі недосягнення
          Сторонами згоди, спір передається на вирішення до суду за правилами
          підвідомчості та підсудністю, визначеними законодавством України.
        </p>

        <h2>13. ПРИКІНЦЕВІ ПОЛОЖЕННЯ</h2>

        <p>
          13.1. Замовник не повинен здійснювати дії, спрямовані на залучення
          фахівців Виконавця до роботи в Замовника з переходом до нього на
          роботу, як штатним співробітником, так і сумісником.
        </p>

        <p>
          13.2. Усі зміни та доповнення до цього Договору мають силу, якщо вони
          вчинені в письмовій формі та підписані уповноваженими представниками
          обох Сторін.
        </p>

        <p>
          13.3. Сторони надають дозвіл одна одній на обробку персональних даних
          своїх та своїх працівників, необхідних для виконання цього договору,
          для забезпечення діяльності підприємства, реалізації
          адміністративно-правових відносин, податкових відносин, відносин у
          сфері бухгалтерського обліку, у сфері реклами, відносин у сфері
          звітності; гарантують дотримання вимог Закону України «Про захист
          персональних даних»; заявляють, що повідомлено про включення
          персональних даних до баз персональних даних контрагента та про свої
          права згідно з законом і про осіб, яким такі дані надаються.
        </p>

        <p>
          13.4. Сторони домовляються, що всі зміни та повідомлення, пов’язані з
          виконанням цього Договору можуть додатково передаватись електронною
          поштою або месенджерами.
        </p>

        <p>
          13.5. Сторони визнають юридичну силу документів, включаючи, але не
          обмежуючись екземплярами цього Договору, Актами, будь-якими іншими
          листами, повідомленнями, передані електронною поштою, месенджерами,
          поштою України та кур'єрською службою.
        </p>

        <p>
          13.6. Сторони домовилися, що E-документи, які відправлені, завірені
          ЕЦП, мають повну юридичну силу, породжують права та обов'язки для
          Сторін, можуть бути представлені до суду як належні докази та
          визнаються рівнозначними документам, що складаються на паперовому
          носієві. Підтвердження передачі документів (відправлення, отримання,
          тощо) вважається легітимним підтвердженням фактичного
          прийняття-передання таких документів уповноваженими особами Сторін і
          не вимагає додаткового доказування.
        </p>
      </main>
    </Layout>
  );
};

export default OfertaPage;
